chimarkhi/qtag-nrf-sdk12/nRF5_SDK_12.2.0_f012efa/examples/ble_peripheral/ble_app_temp_queuing/main.c
static ble_nus_t                        m_nus;                                      /**< Structure to identify the Nordic UART Service. */
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */

static ble_uuid_t                       m_adv_uuids[] = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};  /**< Universally unique service identifier. */
static volatile uint8_t write_flag = 0;
time_t tstamp_sec;
static ble_gap_adv_params_t m_adv_params;                                 /**< Parameters to be passed to the stack when starting advertising. */
static uint8_t m_beacon_info[APP_BEACON_INFO_LENGTH] =                    /**< Information advertised by the Beacon. */
{
    APP_DEVICE_TYPE,     // Manufacturer specific information. Specifies the device type in this
                         // implementation.
    APP_ADV_DATA_LENGTH, // Manufacturer specific information. Specifies the length of the
                         // manufacturer specific data in this implementation.
    APP_BEACON_UUID,     // 128 bit UUID value.
    APP_MAJOR_VALUE,     // Major arbitrary value that can be used to distinguish between Beacons.
    APP_MINOR_VALUE,     // Minor arbitrary value that can be used to distinguish between Beacons.
    APP_MEASURED_RSSI    // Manufacturer specific information. The Beacon's measured TX power in
                         // this implementation.
};

static uint8_t m_beacon_info_test[3] = {0xAB,0x12,0x98};

APP_TIMER_DEF(m_advdata_update_timer);
APP_TIMER_DEF(m_dataToDB_timer);
APP_TIMER_DEF(m_tstamp_timer);



/***@brief function for initializing nrf logging.
*/
void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

uint32_t temperature_data_get(void)
{
    int32_t temp;
    uint32_t err_code;

    err_code = sd_temp_get(&temp);
    APP_ERROR_CHECK(err_code);

    temp = temp*25; // -200 for Minew_Tag16 and 07; -425 for Minew_tag13;
    int8_t exponent = -2;
    return ((exponent & 0xFF) << 24) | (temp & 0x00FFFFFF);
}

uint16_t humid_data_get(void)
{
    int16_t humid = 0x002F;
    uint32_t err_code;

    return humid;
}


static void advdata_update(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    uint8_t       flags = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;
    uint8_t		  door_status = 0x00;

    ble_advdata_service_data_t service_data[4];
	
//		uint8_t battery_data = battery_level_get();
    uint8_t battery_data = 0x63;
    uint16_t temperature_data = temperature_data_get();
    uint16_t humid_data = humid_data_get();
		uint16_t recKey_data = get_recKey();
	
		service_data[0].service_uuid = UNIXTIME_SERVICE_UUID;
    service_data[0].data.size    = sizeof(tstamp_sec);
    service_data[0].data.p_data  = (uint8_t *) &tstamp_sec;

    service_data[1].service_uuid = BLE_UUID_HEALTH_THERMOMETER_SERVICE;
    service_data[1].data.size    = sizeof(temperature_data);
    service_data[1].data.p_data  = (uint8_t *) &temperature_data;

    service_data[2].service_uuid = HUMIDITY_SERVICE_UUID;
    service_data[2].data.size    = sizeof(humid_data);
    service_data[2].data.p_data  = (uint8_t *) &humid_data;

    service_data[2].service_uuid = RECKEY_SERVICE_UUID;
    service_data[2].data.size    = sizeof(recKey_data);
    service_data[2].data.p_data  = (uint8_t *) &recKey_data;


    // Build and set advertising data
    memset(&advdata, 0, sizeof(advdata));

    ble_advdata_manuf_data_t manuf_specific_data;

    manuf_specific_data.company_identifier = APP_COMPANY_IDENTIFIER;

    uint8_t test[] = {0x12};
    manuf_specific_data.data.p_data = test;
    manuf_specific_data.data.size   = 1;
//    manuf_specific_data.data.size   = APP_BEACON_INFO_LENGTH;

    advdata.include_appearance  		 = false;
	advdata.name_type               = BLE_ADVDATA_SHORT_NAME;
	advdata.short_name_len					= 5;
    advdata.p_manuf_specific_data = &manuf_specific_data;

    advdata.flags		         = flags;
    advdata.service_data_count   = 1;
    advdata.p_service_data_array = service_data;

    err_code = ble_advdata_set(&advdata, NULL);
    SEGGER_RTT_printf(0,"adv set err: %d\r\n",err_code);
    APP_ERROR_CHECK(err_code);
}


void advdata_update_timer_timeout_handler(void * p_context)
{
  advdata_update();	
}

void tstamp_timer_timeout_handler(void * p_context)
{
  ++tstamp_sec;
//	SEGGER_RTT_printf(0,"Timestamp %d\r\n",tstamp_sec);
}

void tstamp_init()
{
//	tstamp_sec = 0x58EF93FA; 
		tstamp_sec = 0x0;
}

void dataToDB_timer_timeout_handler(void * p_context)
{
	time_t date_hour_seconds = tstamp_sec;
	//db_data_t data;
	
	uint16_t temp =  temperature_data_get();
	uint16_t humid = humid_data_get();
	uint32_t timeStamp = date_hour_seconds;
	uint32_t recKey = get_recKey();
	
	uint32_t dataPacket_global[3] = {recKey,
													 timeStamp,
													 (temp << 16) | humid};	
	SEGGER_RTT_printf(0,"RecKey : %08x, time: %08x, data : %08x, len: %d\r\n", dataPacket_global[0], dataPacket_global[1], dataPacket_global[2], 3);
	uint32_t err_code = fds_write(FILE_ID, recKey, dataPacket_global, 3);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);

    uint32_t err_code = app_timer_create(&m_advdata_update_timer, APP_TIMER_MODE_REPEATED, advdata_update_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);
	
